Revit 2027 API
AnalysisDisplayStyleDiagramTextLabelType Enumeration
 Defines text label visualization types for diagram settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleDiagramTextLabelType
Public Enumeration AnalysisDisplayStyleDiagramTextLabelType
public enum class AnalysisDisplayStyleDiagramTextLabelType
type AnalysisDisplayStyleDiagramTextLabelType
Members
Member name | Value | Description
ShowAll | 0 |  Show diagram text label for each point
ShowNone | 1 |  Don't show diagram text labels
ShowPredefined | 2 |  Show diagram text label only for points that have flag ValueAtPointFlags::DisplayText
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace